Процедура СоздатьДоходностьОблигации(ЦБСсылка, Дата, КПогашению, Купонная) Экспорт

	МенеджерЗаписи = РегистрыСведений.ДоходностиОблигаций.СоздатьМенеджерЗаписи();
		
	МенеджерЗаписи.ЦБ = ЦБСсылка;
	МенеджерЗаписи.Период = Дата;
	//МенеджерЗаписи.Прочитать();
	
	//Если МенеджерЗаписи.ЦБ.Пустая() Тогда // Записи нет еще
	//
	//	МенеджерЗаписи.ЦБ = ЦБСсылка;
	//	МенеджерЗаписи.Период = Дата;
	//
	//КонецЕсли; 
	
	//Если КПогашению<>Неопределено Тогда
		МенеджерЗаписи.КПогашению = КПогашению;
	//КонецЕсли; 
	
	//Если Купонная<>Неопределено Тогда
		МенеджерЗаписи.Купонная = Купонная;
	//КонецЕсли; 


	МенеджерЗаписи.Записать();

КонецПроцедуры

Процедура СоздатьКупон(ЦБСсылка, ДатаКупона, РазмерКупона) Экспорт

	Если ДатаКупона=Дата(1,1,1) Тогда
		Возврат; 	
	КонецЕсли; 
	
	МенеджерЗаписи = РегистрыСведений.КупоныОблигаций.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.ЦБ = ЦБСсылка;
	МенеджерЗаписи.Период = ДатаКупона;
	МенеджерЗаписи.СуммаКупона = РазмерКупона;

	МенеджерЗаписи.Записать();

КонецПроцедуры

Процедура СоздатьНоминалОблигации(ЦБСсылка, Дата, СуммаНоминала) Экспорт

	Отбор = Новый Структура("ЦБ", ЦБСсылка); 
	ПредыдущийНоминал = РегистрыСведений.НоминалыОблигаций.ПолучитьПоследнее(Дата,Отбор).СуммаНоминала;
	
	Если ПредыдущийНоминал<>СуммаНоминала Тогда
	
		МенеджерЗаписи = РегистрыСведений.НоминалыОблигаций.СоздатьМенеджерЗаписи();
		
		МенеджерЗаписи.ЦБ = ЦБСсылка;
		МенеджерЗаписи.Период = Дата;
		МенеджерЗаписи.СуммаНоминала = СуммаНоминала;

		МенеджерЗаписи.Записать();
	
	КонецЕсли; 
	

КонецПроцедуры


Процедура СоздатьКотировку(ЦБСсылка, Дата, Цена, ЦенаЗакрытия=0, ЦенаСредневзвеш=0, НКД=0) Экспорт

	МенеджерЗаписи = РегистрыСведений.Котировки.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.ЦБ = ЦБСсылка;
	МенеджерЗаписи.Период = Дата;
	МенеджерЗаписи.Цена = Цена;
	МенеджерЗаписи.ЦенаЗакрытия = ЦенаЗакрытия;
	МенеджерЗаписи.ЦенаСредневзвеш = ЦенаСредневзвеш;
	МенеджерЗаписи.НКД = НКД;

	МенеджерЗаписи.Записать();

КонецПроцедуры

Процедура СоздатьОферту(ЦБСсылка, Дата, ТипОферты=Неопределено, ЦенаВыкупа=Неопределено) Экспорт

	МенеджерЗаписи = РегистрыСведений.ОфертыОблигаций.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.ЦБ = ЦБСсылка;
	МенеджерЗаписи.Период = Дата;
	
	МенеджерЗаписи.Прочитать();
	
	Если МенеджерЗаписи.ЦБ.Пустая() Тогда // Записи нет еще
	
		МенеджерЗаписи.ЦБ = ЦБСсылка;
		МенеджерЗаписи.Период = Дата;
	
	КонецЕсли; 
	
	Если ТипОферты<>Неопределено Тогда
		МенеджерЗаписи.ТипОферты = ТипОферты;
	КонецЕсли; 
	
	Если ЦенаВыкупа<>Неопределено Тогда
		МенеджерЗаписи.ЦенаВыкупа = ЦенаВыкупа;
	КонецЕсли; 

	МенеджерЗаписи.Записать();

КонецПроцедуры

Процедура ОчиститьЗагрузкуБумаг() Экспорт

	НаборЗаписей = РегистрыСведений.ЗагрузкаБумаг.СоздатьНаборЗаписей();
	НаборЗаписей.Записать(Истина);

КонецПроцедуры
 
Процедура ОбъеденитьЭмитентов(СписокЭмитентов, ОсновнойЭмитент=Неопределено) Экспорт

	// Получить список заменяемых эмитентов
	
	Если ОсновнойЭмитент=Неопределено Тогда
		ОсновнойЭмитент = СписокЭмитентов[0];	
	КонецЕсли;
	
	ЗаменяемыеЭмитенты = Новый Массив;
	
	Для каждого Эмитент Из СписокЭмитентов Цикл
	
		Если Эмитент<>ОсновнойЭмитент Тогда
		
			ЗаменяемыеЭмитенты.Добавить(Эмитент);	
		
		КонецЕсли; 	
	
	КонецЦикла;
	
	// Заменить
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦенныеБумаги.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ЦенныеБумаги КАК ЦенныеБумаги
		|ГДЕ
		|	ЦенныеБумаги.Эмитент В(&СписокЭмитентов)";
	
	Запрос.УстановитьПараметр("СписокЭмитентов", ЗаменяемыеЭмитенты);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЦБОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		ЦБОбъект.Эмитент = ОсновнойЭмитент;
		ЦБОбъект.Записать();
	КонецЦикла;
	
	// Удалить
	
	Для каждого Эмитент Из ЗаменяемыеЭмитенты Цикл
	
		//Эмитент = Справочники.Эмитенты.НайтиПоКоду("ав");
		Об = Эмитент.ПолучитьОбъект();	
		Об.Удалить();
	КонецЦикла; 
	

КонецПроцедуры
  
 
