
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр Личный 
	Движения.Личный.Записывать = Истина;
	Движение = Движения.Личный.Добавить();
	Движение.Период = Дата;
	Движение.СчетДт = СчетДт;
	Движение.СчетКт = СчетКт;
	Движение.Сумма = Сумма;

	Для каждого ТекСтрокаСубконтоДт Из СубконтоДт Цикл
		Движение.СубконтоДт[ТекСтрокаСубконтоДт.Вид] = ТекСтрокаСубконтоДт.Значение;	
	КонецЦикла; 
	
	Для каждого ТекСтрокаСубконтоКт Из СубконтоКт Цикл
		Движение.СубконтоКт[ТекСтрокаСубконтоКт.Вид] = ТекСтрокаСубконтоКт.Значение;	
	КонецЦикла; 

	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
