
&НаСервере
Процедура СчетКтПриИзмененииНаСервере(ПоказыватьВалюту)
	РаботаСФормамиВызовСервера.ЗаполнитьТаблицуСубконто(Объект.СчетКт, Объект.СубконтоКт);
	ПоказыватьВалюту = НужноПоказатьВалюту();
КонецПроцедуры


&НаКлиенте
Процедура СчетКтПриИзменении(Элемент)
	ПоказыватьВалюту = Ложь;	
	СчетКтПриИзмененииНаСервере(ПоказыватьВалюту);
	УстановитьВидимостьТЧ(Элементы.СубконтоКт, Объект.СубконтоКт.Количество());
	ПоказатьВалюту(ПоказыватьВалюту);
КонецПроцедуры


&НаСервере
Процедура СчетДтПриИзмененииНаСервере(ПоказыватьВалюту)
	РаботаСФормамиВызовСервера.ЗаполнитьТаблицуСубконто(Объект.СчетДт, Объект.СубконтоДт);
	ПоказыватьВалюту = НужноПоказатьВалюту();
КонецПроцедуры


&НаКлиенте
Процедура СчетДтПриИзменении(Элемент)
	ПоказыватьВалюту = Ложь;	
	СчетДтПриИзмененииНаСервере(ПоказыватьВалюту);
	УстановитьВидимостьТЧ(Элементы.СубконтоДт, Объект.СубконтоДт.Количество());
	ПоказатьВалюту(ПоказыватьВалюту);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьТЧ(ЭлементТЧ, КоличествоСтрок)

	Если КоличествоСтрок>0 Тогда
		ЭлементТЧ.Видимость=Истина;
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВалюту(Показать)
	
	Элементы.ГруппаОбмен.Видимость = Показать;
	//Элементы.СуммаВал.Видимость = Показать;
	//Элементы.Курс.Видимость = Показать;

КонецПроцедуры
 

&НаСервере
Функция НужноПоказатьВалюту()
	Если Объект.СчетКт.Пустая() ИЛИ Объект.СчетДт.Пустая() Тогда
	
		Возврат Ложь;	
	
	Иначе
	
		Возврат НЕ Объект.СчетКт.Валюта=Объект.СчетДт.Валюта;	
		
	КонецЕсли; 
	 
КонецФункции // НужноАктивироватьВалюту()

&НаКлиенте
Процедура СуммаВалПриИзменении(Элемент)
	ОбновитьКурс();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКурс()

	Если Объект.Сумма<>0 И Объект.СуммаВал<>0 Тогда
		
		Объект.Курс = Объект.Сумма / Объект.СуммаВал;
		
	КонецЕсли; 	

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Валюта
	Элементы.ГруппаОбмен.Видимость = НужноПоказатьВалюту();
	// СубконтоДт
	Если Объект.СубконтоДт.Количество()>0 Тогда
		Элементы.СубконтоДт.Видимость=Истина;
	Иначе	
		Элементы.СубконтоДт.Видимость=Ложь;
	КонецЕсли;
	// СубконтоКт
	Если Объект.СубконтоКт.Количество()>0 Тогда
		Элементы.СубконтоКт.Видимость=Истина;
	Иначе	
		Элементы.СубконтоКт.Видимость=Ложь;
	КонецЕсли; 

КонецПроцедуры
 

//&НаСервере
//Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
//	Если Объект.СчетКт = Объект.СчетДт Тогда
//	
//		Отказ=Истина;
//		
//		Сообщение = Новый СообщениеПользователю;
//		Сообщение.Текст = "Счета одинаковые";
//		Сообщение.Поле = "СчетКт";
//		Сообщение.УстановитьДанные(ЭтотОбъект);
//		Сообщение.Сообщить(); 
//	
//	КонецЕсли; 
//КонецПроцедуры



