
Процедура ОбработкаПроведения(Отказ, Режим)

	// Новая с контролем
	Движения.ОстаткиДенежныхСредств.Записывать = Истина;

	// регистр ОстаткиДенежныхСредств Расход
	Движение = Движения.ОстаткиДенежныхСредств.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.БрокерскийСчет = БрокерскийСчет;
	Движение.Сумма = Сумма;
	
	Движения.ОстаткиДенежныхСредств.БлокироватьДляИзменения = Истина;
	Движения.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиДенежныхСредствОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиДенежныхСредств.Остатки(&Граница, БрокерскийСчет = &БрокерскийСчет) КАК ОстаткиДенежныхСредствОстатки
		|ГДЕ
		|	ОстаткиДенежныхСредствОстатки.СуммаОстаток < 0";
	
	Запрос.УстановитьПараметр("БрокерскийСчет", БрокерскийСчет);
	Запрос.УстановитьПараметр("Граница", Новый Граница(МоментВремени()));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Отказ=Истина;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не хватает средств для вывода в сумме "+ -ВыборкаДетальныеЗаписи.СуммаОстаток;
		Сообщение.Поле = "";
		Сообщение.УстановитьДанные();
		Сообщение.Сообщить(); 
	КонецЦикла;
	

	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
