
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// Вид счета (активный, пассивный)
	пВид = ТекущийОбъект.ВидСчета.Вид;
	Если пВид=Перечисления.ВидыСчетов.Активный Тогда
		ТекущийОбъект.Вид=ВидСчета.Активный;		
	ИначеЕсли пВид=Перечисления.ВидыСчетов.Пассивный Тогда
		ТекущийОбъект.Вид=ВидСчета.Пассивный;		
	ИначеЕсли пВид=Перечисления.ВидыСчетов.АктивноПассивный Тогда
		ТекущийОбъект.Вид=ВидСчета.АктивноПассивный;		
	КонецЕсли;
	// Валюта
	Если ТекущийОбъект.Валюта <> Константы.ВалютаУчета.Получить() Тогда
		ТекущийОбъект.Валютный = Истина;	
	КонецЕсли; 
	
КонецПроцедуры

