
Процедура ОбработкаПроведения(Отказ, Режим)
	
	
	// Новая с контролем (если не маржинальное кредитование)	
	Движения.ОстаткиДенежныхСредств.Записывать = Истина;
	
	
	// регистр ОстаткиДенежныхСредств Расход
	Движение = Движения.ОстаткиДенежныхСредств.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.БрокерскийСчет = БрокерскийСчет;
	// Для табличной части
	//Движение.Сумма = СписокПокупок.Итог("Сумма")+ СписокПокупок.Итог("Комиссия")+СписокПокупок.Итог("НКД"); // СуммаВсегоСКомиссиейИНКД;
	// Для реквизитов
	Движение.Сумма = Сумма+ Комиссия+НКД; // СуммаВсегоСКомиссиейИНКД;

	Движения.ОстаткиДенежныхСредств.БлокироватьДляИзменения = Истина;
	Движения.Записать();
	
	// Контроль
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиДенежныхСредствОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиДенежныхСредств.Остатки(&Граница, БрокерскийСчет = &БрокерскийСчет) КАК ОстаткиДенежныхСредствОстатки
		|ГДЕ
		|	ОстаткиДенежныхСредствОстатки.СуммаОстаток < 0";
	
	Запрос.УстановитьПараметр("БрокерскийСчет", БрокерскийСчет);
	Запрос.УстановитьПараметр("Граница", Новый Граница(МоментВремени()));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Отказ=Истина;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не хватает денег на счету в сумме "+-ВыборкаДетальныеЗаписи.СуммаОстаток;
		//Сообщение.Поле = "";
		//Сообщение.УстановитьДанные();
		Сообщение.Сообщить(); 
	КонецЦикла;
	
	Если Отказ Тогда
		Возврат;	
	КонецЕсли; 
	
	// Новая без контроля
	Движения.ОстаткиЦенныхБумаг.Записывать = Истина;
	
	// Для реквизитов
	
	Движение = Движения.ОстаткиЦенныхБумаг.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.БрокерскийСчет = БрокерскийСчет;
	Движение.ЦеннаяБумага = ЦеннаяБумага;
	Движение.Партия = Ссылка;
	Движение.Количество = Количество;
	Движение.Сумма = Сумма;
	Движение.НКД = НКД;
	Движение.Комиссия = Комиссия;
	
	// Для табличной части
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ПокупкаЦенныхБумагСписокПокупок.ЦеннаяБумага КАК ЦеннаяБумага,
	//	|	СУММА(ПокупкаЦенныхБумагСписокПокупок.Количество) КАК Количество,
	//	|	СУММА(ПокупкаЦенныхБумагСписокПокупок.Сумма) КАК Сумма,
	//	|	СУММА(ПокупкаЦенныхБумагСписокПокупок.НКД) КАК НКД,
	//	|	СУММА(ПокупкаЦенныхБумагСписокПокупок.Комиссия) КАК Комиссия
	//	|ИЗ
	//	|	Документ.ПокупкаЦенныхБумаг.СписокПокупок КАК ПокупкаЦенныхБумагСписокПокупок
	//	|ГДЕ
	//	|	ПокупкаЦенныхБумагСписокПокупок.Ссылка = &Ссылка
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	ПокупкаЦенныхБумагСписокПокупок.ЦеннаяБумага";
	//
	//Запрос.УстановитьПараметр("Ссылка", Ссылка);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	// регистр ОстаткиЦенныхБумаг Приход
	//	
	//	Движение = Движения.ОстаткиЦенныхБумаг.Добавить();
	//	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	//	Движение.Период = Дата;
	//	Движение.БрокерскийСчет = БрокерскийСчет;
	//	Движение.ЦеннаяБумага = ВыборкаДетальныеЗаписи.ЦеннаяБумага;
	//	Движение.Партия = Ссылка;
	//	Движение.Количество = ВыборкаДетальныеЗаписи.Количество;
	//	Движение.Сумма = ВыборкаДетальныеЗаписи.Сумма;
	//	Движение.НКД = ВыборкаДетальныеЗаписи.НКД;
	//	Движение.Комиссия = ВыборкаДетальныеЗаписи.Комиссия;
	//	
	//КонецЦикла;
	


	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!


	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

