
&НаСервереБезКонтекста
Процедура ОбъеденитьВыбранныхНаСервере(СписокЭмитентов, ОсновнойЭмитент)
	РаботаСРегистрами.ОбъеденитьЭмитентов(СписокЭмитентов, ОсновнойЭмитент);
КонецПроцедуры

&НаКлиенте
Процедура ОбъеденитьВыбранных(Команда)
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ЗакрытиеФормыВыбораОсновного", ЭтотОбъект, ВыделенныеСтроки);
	ПараметрыФормы = Новый Структура("Отбор", Новый Структура("Ссылка", ВыделенныеСтроки));
	ОткрытьФорму("Справочник.Эмитенты.ФормаВыбора", ПараметрыФормы, ЭтотОбъект, УникальныйИдентификатор,,,ОповещениеОЗакрытии);
	
	//ОбъеденитьВыбранныхНаСервере(ВыделенныеСтроки);
	//Элементы.Список.Обновить();
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеФормыВыбораОсновного(РезультатЗакрытия, ДополнительныеПараметры) Экспорт

	Если ТипЗнч(РезультатЗакрытия) = Тип("СправочникСсылка.Эмитенты")  Тогда
	
		ОбъеденитьВыбранныхНаСервере(ДополнительныеПараметры, РезультатЗакрытия);
		Элементы.Список.Обновить();
	
	КонецЕсли;  	

КонецПроцедуры
 
