&НаСервере
Процедура ЗагрузитьНаСервере(РезультатЗагрузки)

	ИмяФайла = "C:\Users\Andrey\Documents\1C\МоиАктивы\ЗагрузкаXML\GetBrokerReport.xml";
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЗагрузитьОтчет(ИмяФайла, БрокерскийСчет, РезультатЗагрузки);
		

КонецПроцедуры


&НаСервере
Процедура ЗагрузитьНаСервереРаботаетСВТБ()

	ИмяФайла = "C:\Users\Andrey\Documents\1C\МоиАктивы\ЗагрузкаXML\GetBrokerReport.xml";
	
	ЧтениеТекста = Новый ЧтениеТекста(ИмяФайла, КодировкаТекста.UTF8);
	СтрокаXML = ЧтениеТекста.Прочитать();
	
	//СтрокаXML = СтрЗаменить(СтрокаXML,"<PurchaseOrder","<PurchaseOrder xmlns=""http://www.microsoft-demo-liquid.com""");	
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(СтрокаXML);
	
	
	Пакет=ФабрикаXDTO.Пакеты.Получить("report577p_v1");
	СвойствоReport=Пакет.КорневыеСвойства.Получить("Report");	
		//PurchaseOrder = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, СвойствоPurchaseOrder.Тип);
	
	Report = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, СвойствоReport.Тип);
	
	Объект.СписокСделок.Очистить();	
	
	// Список сделок
	Для каждого Сделка Из Report.ЗавершенныеСделки.СписокСделок.Сделка Цикл
	
		НоваяСтрока=Объект.СписокСделок.Добавить();
		НоваяСтрока.Инструмент  = Сделка.Инструмент;
		НоваяСтрока.ТипСделки = Сделка.ТипСделки;
		НоваяСтрока.ДатаСделки = Сделка.ДатаСделки;
		НоваяСтрока.Количество = Сделка.Количество;
		НоваяСтрока.Цена = Сделка.Цена;
		НоваяСтрока.СуммаСделки = Сделка.СуммаСделки;
	
	КонецЦикла; 
	
	

КонецПроцедуры
 

&НаСервереБезКонтекста
Процедура ЗагрузитьНаСервереРаботающийПример()
	ИмяФайла = "C:\Users\Andrey\Documents\1C\МоиАктивы\ЗагрузкаXML\microsoft-demo.xml";
	
	ЧтениеТекста = Новый ЧтениеТекста(ИмяФайла, КодировкаТекста.UTF8);
	СтрокаXML = ЧтениеТекста.Прочитать();
	
	СтрокаXML = СтрЗаменить(СтрокаXML,"<PurchaseOrder","<PurchaseOrder xmlns=""http://www.microsoft-demo-liquid.com""");	
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(СтрокаXML);
	
	СписокСделок = Новый Массив;
	
	// Если описаны типы то так
	//ТипPurchaseOrder = ФабрикаXDTO.Тип("http://www.microsoft-demo-liquid.com", "Type_PurchaseOrder");
	//
	//ИPurchaseOrder = ТипPurchaseOrder.Свойства Свойства.Получить("PurchaseOrder").Тип;
	// Если описаны свойства, то так
	 Пакет=ФабрикаXDTO.Пакеты.Получить("http://www.microsoft-demo-liquid.com");
	СвойствоPurchaseOrder=Пакет.КорневыеСвойства.Получить("PurchaseOrder");	
		//PurchaseOrder = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, СвойствоPurchaseOrder.Тип);
	
	PurchaseOrder = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, СвойствоPurchaseOrder.Тип);
	
	ДатаПоставки = PurchaseOrder.OrderDate;
	
	Для каждого Адрес Из PurchaseOrder.Address Цикл
	
		Город = Адрес.City;	
	
	КонецЦикла;
	
	
	
	//Для каждого Item Из PurchaseOrder.Items Цикл
	//
	//	НазваниеПродукта = Item.ProductName;	
	//
	//КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	перем РезультатЗагрузки;
	ЗагрузитьНаСервере(РезультатЗагрузки);
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Загрузка окончена "+ РезультатЗагрузки.ЗаголовокОтчета+ 
		". Загружено сделок "+РезультатЗагрузки.ЗагруженоСделок+". Всего сделок "+РезультатЗагрузки.ВсегоСделок+
		" Загружено движений денег "+ РезультатЗагрузки.ЗагруженоДенег+ " Всего движений денег "+РезультатЗагрузки.ВсегоДенег;
	//Сообщение.Поле = "";
	//Сообщение.УстановитьДанные();
	Сообщение.Сообщить(); 
КонецПроцедуры
