// Загружает данные из файла или с сайта Мосбиржи
//
// Параметры:
//  ЧтоЗагружать	 - Строка	 -  "Акции", "ОФЗ", "КорпОблигации" или имя файла
//  ОбновлятьБумаги	 - Булево	 -  Перетирает данные по уже загруженным бумагам
//  ТолькоИнфо		 - Булево	 -  Не записывать данные в базу, только заполнять ТаблицуЗначений
//  ТаблицаЗагрузки	 - ТаблицаЗначений	 -  Если определена, заполняется данными файла
//
Процедура ЗагрузитьДанные(ЧтоЗагружать, ВозвращаемоеЗначение, ОбновлятьБумаги=Ложь, ТолькоИнфо=Ложь, ТаблицаЗагрузки=Неопределено) Экспорт

	АдресОФЗ = "https://iss.moex.com/iss/engines/stock/markets/bonds/boardgroups/58/securities.xml"; // Облигации Т+1
	АдресКорпОблиг = "https://iss.moex.com/iss/engines/stock/markets/bonds/boardgroups/7/securities.xml"; // Облигации Т0
	АдресАкции = "https://iss.moex.com/iss/engines/stock/markets/shares/boardgroups/57/securities.xml"; // Акции

	ЧтениеXMLФайл = Новый ЧтениеXML$
	
	Если ЧтоЗагружать="Акции" Тогда
	
		Поток = ПолучитьПотокВеб(АдресАкции);
		ЧтениеXMLФайл.ОткрытьПоток(Поток);
	
	ИначеЕсли ЧтоЗагружать="ОФЗ" Тогда
	
		Поток = ПолучитьПотокВеб(АдресОФЗ);
		ЧтениеXMLФайл.ОткрытьПоток(Поток);
		
	ИначеЕсли ЧтоЗагружать="КорпОблигации" Тогда
	
		Поток = ПолучитьПотокВеб(АдресКорпОблиг);
		ЧтениеXMLФайл.ОткрытьПоток(Поток);
		
	Иначе // Файл
		
		ОбъектФайл = Новый Файл(ЧтоЗагружать);
		Если ОбъектФайл.Существует() Тогда
			
			ЧтениеXMLФайл.ОткрытьФайл(ЧтоЗагружать);
			
		Иначе
			
			ВозвращаемоеЗначение.Результат = Ложь;
			ВозвращаемоеЗначение.Сообщение = "Не найден файл или неверная команда";
			Возврат;
		
		КонецЕсли; 
	
	КонецЕсли; 
	
	РезультатЧтения=ЧтениеXMLФайл.Прочитать();
	
	Пока РезультатЧтения Цикл
	
		Если ЧтениеXMLФайл.ТипУзла = ТипУзлаXML. НачалоЭлемента Тогда
			
			
			
		КонецЕсли;
	
	
	КонецЦикла; 

	
	
КонецПроцедуры

Функция СоздатьВозвращаемоеЗначение()

	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("Результат");
	ВозвращаемоеЗначение.Вставить("Сообщение");
	

КонецФункции // СоздатьВозвращаемоеЗначение()
 

Функция ПолучитьПотокВеб(АдресФайлаВеб)
	URI = ОбщегоНазначенияКлиентСервер.СтруктураURI(АдресФайлаВеб);
	Если URI.Схема = "https" Тогда
	    
		БезопасноеСоединение = Новый HTTPСоединение(URI.ИмяСервера,443,,,,,Новый ЗащищенноеСоединениеOpenSSL());
		Запрос = Новый HTTPЗапрос(URI.ПутьНаСервере);
		Ответ = БезопасноеСоединение.Получить(Запрос).ПолучитьТелоКакПоток();
		Возврат Ответ;
	КонецЕсли;
	Возврат Неопределено;

КонецФункции