
&НаКлиенте
Процедура Облигации(Команда)
	Список.Отбор.Элементы.Очистить();
	ДобавитьОтбор("ВидЦБ",ПолучитьВидЦБ("Облигация"));
	
	
	
	//НовЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//НовЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидЦБ"); 
	//НовЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;

	//НовЭлементОтбора.Использование = Истина;

	//НовЭлементОтбора.ПравоеЗначение = ПолучитьВидЦБ("Облигация");
	
	//Список.Отбор.ВидЦБ.Установить(ПолучитьВидЦБ("Облигация"));
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВидЦБ(ВидСтроковый)

	Если ВидСтроковый="Облигация" Тогда
	
		Возврат Перечисления.ВидыЦБ.Облигация;	
	
	Иначе
	
		Возврат Перечисления.ВидыЦБ.Акция;
	
	КонецЕсли; 

КонецФункции // ПолучитьВидЦБ()

&НаКлиенте
Процедура ДобавитьОтбор(Поле, Значение)

	НовЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Поле); 
	НовЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;

	НовЭлементОтбора.Использование = Истина;

	НовЭлементОтбора.ПравоеЗначение = Значение;

КонецПроцедуры
 